Documents/УстановкаКурсовВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>УстановкаКурсовВалют</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КурсыВалют</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>КурсыВалют</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УстановкаКурсовВалют/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр КурсыВалют
	Движения.КурсыВалют.Записывать = Истина;
	Для Каждого ТекСтрокаКурсыВалют Из КурсыВалют Цикл
		Движение = Движения.КурсыВалют.Добавить();
		Движение.Период = Дата;
		Движение.Валюта = ТекСтрокаКурсыВалют.Валюта;
		Движение.Курс = ТекСтрокаКурсыВалют.Курс;
	КонецЦикла;
КонецПроцедуры
